IDENTIFICATION DIVISION.
PROGRAM-ID. COMPUTE-INTEREST.

WORKING-STORAGE SECTION.
01 WS-PRINCIPAL PIC 9(9)V99.
01 WS-RATE      PIC 9(3)V99.
01 WS-YEARS     PIC 9(3).
01 WS-INTEREST  PIC 9(9)V99.

PROCEDURE DIVISION.
COMPUTE-INTEREST.
    COMPUTE WS-INTEREST = WS-PRINCIPAL * WS-RATE / 100 * WS-YEARS.
    IF WS-INTEREST > 10000
        MOVE 10000 TO WS-INTEREST.
    DISPLAY WS-INTEREST.
    STOP RUN.
